Documents/УстановкаУчётнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаУчётнойПолитики</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УчётнаяПолитика</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчётнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчётнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УчётнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УчётнаяПолитика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>УчётнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчётнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыУчётнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчётнойПолитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаУчётнойПолитики/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчётнаяПолитикаСрезПоследних.УчётнаяПолитика КАК УчётнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УчётнаяПолитика.СрезПоследних КАК УчётнаяПолитикаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущаяУчётнаяПолитика = Выборка.УчётнаяПолитика;
	КонецЦикла;
	
	Движения.УчётнаяПолитика.Записывать = Истина;
	Движение = Движения.УчётнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчётнаяПолитика = УчётнаяПолитика;
	
	Если (ТекущаяУчётнаяПолитика = Перечисления.ВидыУчётнойПолитики.FIFO) И
		(УчётнаяПолитика = Перечисления.ВидыУчётнойПолитики.ПоСредней) Тогда
		
		Движения.ТоварыНаСкладах.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		               |	ТоварыНаСкладахОстатки.Склад КАК Склад,
		               |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		               |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки
		               |ИТОГИ
		               |	СУММА(КоличествоОстаток)
		               |ПО
		               |	Номенклатура";
		Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			
			Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка, , "СрокГодности");
		КонецЦикла;
	ИначеЕсли (ТекущаяУчётнаяПолитика = Перечисления.ВидыУчётнойПолитики.ПоСредней) И
		(УчётнаяПолитика = Перечисления.ВидыУчётнойПолитики.FIFO) Тогда
		//?? 
	КонецЕсли;
КонецПроцедуры
